app/controllers/masters_controller.rb

  def index
    @masters = Master.all
---
SELECT "masters".* FROM "masters"

  def show
    @master = Master.find(params[:id])
---
SELECT  "masters".* FROM "masters" WHERE "masters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @master = Master.find(params[:id])
    @master.update(master_params)
---
SELECT  "masters".* FROM "masters" WHERE "masters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "masters" SET "years_lived" = $1 WHERE "masters"."id" = $2  [["years_lived", "1016-1100"], ["id", 2]]